package ch07;

/*
 * ===================================================================================================
 * 07. 자료형(data type) - 실수는 어떻게 표현하나요?
 * ---------------------------------------------------------------------------------------------------
 * 부동 소수점 방식의 오류
 * - 지수와 가수로 나타내는 부동 소수점 방식에서는 지수부가 0을 표현할 수 없기 때문에 약간의 오차가 발생할 수 있다.
 * ===================================================================================================
 */
public class DoubleTest2 {

	public static void main(String[] args) {

		double dnum = 1;

		for (int i = 0; i < 10000; i++) {
			dnum = dnum + 0.1;
		}
		
		System.out.println(dnum); // 출력 결과 1001.000000000159
		
	} // end main()
	
} // end class DoubleTest2
